{"config": [{"config": {"bias_constraint": null, "name": "conv2d_10", "padding": "valid", "trainable": true, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "strides": [1, 1], "batch_input_shape": [null, 32, 32, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "average_pooling2d_4", "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "AveragePooling2D"}, {"config": {"bias_constraint": null, "name": "conv2d_11", "padding": "valid", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_7", "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "name": "conv2d_12", "padding": "valid", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 128, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_8", "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_10", "trainable": true, "units": 256, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "name": "dense_11", "trainable": true, "units": 128, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "name": "dense_12", "trainable": true, "units": 6, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5"}