{"keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 32, "trainable": true, "use_bias": true, "batch_input_shape": [null, 128, 128, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "strides": [1, 1], "dtype": "float32", "data_format": "channels_last", "kernel_size": [7, 7], "padding": "valid", "bias_constraint": null, "name": "conv2d_16", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "average_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 32, "trainable": true, "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "padding": "valid", "strides": [1, 1], "name": "conv2d_17", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_16", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 32, "trainable": true, "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "padding": "valid", "strides": [1, 1], "name": "conv2d_18", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "average_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 32, "trainable": true, "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "name": "conv2d_19", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_17", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 32, "trainable": true, "use_bias": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "name": "conv2d_20", "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "average_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_10", "units": 256, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_11", "units": 128, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "dense_12", "units": 6, "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null}}}}]}