{"config": [{"config": {"trainable": true, "use_bias": true, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "padding": "valid", "kernel_size": [7, 7], "batch_input_shape": [null, 32, 32, 1], "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "average_pooling2d_1", "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "use_bias": true, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "padding": "valid", "kernel_size": [5, 5], "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "use_bias": true, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "use_bias": true, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "use_bias": true, "name": "dense_3", "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 6, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "activation": "softmax"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.5", "class_name": "Sequential"}