{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 128, 128, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_46", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "dtype": "float32", "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_46", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_47", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_47", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_48", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_48", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_29", "seed": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_49", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_49", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 128, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_50", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_50", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_10", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_30", "seed": null}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "dense_28", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_31", "seed": null}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "dense_29", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "trainable": true, "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "name": "dense_30", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}}]}