{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 128, 128, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_41", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "dtype": "float32", "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_41", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_42", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_42", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_43", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_43", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_26", "seed": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_44", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_44", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "filters": 128, "data_format": "channels_last", "kernel_regularizer": null, "name": "conv2d_45", "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "valid", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_45", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_9", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_27", "seed": null}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "dense_25", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_28", "seed": null}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "dense_26", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "trainable": true, "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "name": "dense_27", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}}]}